entry_data = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]

def sum_func(data):
    res_list = []
    try:
        [res_list.append(sum(list(map(int, i.split(","))))) for i in data]
        # Робимо try: з ліст комрехеншн та циклом де перебираємо кожен елемент entry_data,
        # кожен елементсплітаємо по роздільнику "," та за допомогою вбудованої
        # функції map() перетворюємо в інт, далі перетворюємо в ліст і просумовуємо
        # в кінці результат записуємо до попередньо створенного списку res_list
    except ValueError:
        res_list.append("Не можу це зробити")
        # Робимо except де очікуємо на певну помилку, в данному випадку ValueError і у разі її
        # виникнення, додаємо коментар до списку з результатом наших дій.
    print(res_list)
sum_func(entry_data)