alice_in_wonderland = ('"Would you tell me, please, which way I ought to go from here?"\n'
                       '"That depends a good deal on where you want to get to," said the Cat.\n'
                       '"I don\')t much care where ——" said Alice.\n'
                       '"Then it doesn\'t matter which way you go," said the Cat.\n'
                       '"—— so long as I get somewhere," Alice added as an explanation.\n'
                       '"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."\n')
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк
print(alice_in_wonderland)

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea = 436402
azov_sea = 37800
total_sea = black_sea + azov_sea
print(f"Площа Чорного моря становить {black_sea} км2, а площа Азовськогоморя\n"
      f"моря становить {azov_sea} км2. Площу яку займають Чорне та Азов-\n"
      f"ське моря разом становить - {total_sea} км2.\n")

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
all_wh, wh1_wh2, wh2_wh3 = 375291, 250449, 222950
wh_3 = all_wh - wh1_wh2
wh_2 = wh2_wh3 - wh_3
wh_1 = all_wh - wh_2 - wh_3
print(f"Мережа супермаркетів має 3 склади, де всього розміщено\n"
      f"{all_wh} товар. На першому та другому складах перебуває\n"
      f"{wh1_wh2} товарів. На другому та третьому – {wh2_wh3} товарів.\n"
      f"На першому складі - {wh_1} товарів. На другому складі - {wh_2} \n"
      f"товарів. На третьому складі - {wh_3} товарів.\n")

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
month_pay = 1179
time4pay = 18
total_sum = month_pay * time4pay
print(f"Михайло разом з батьками вирішили купити комп’ютер, ско-\n"
      f"риставшись послугою «Оплата частинами». Відомо, що сплачу-\n"
      f"вати необхідно буде {time4pay} місяців по {month_pay} грн/місяць.\n"
      f"Загальна вартість комп'ютера склала {total_sum} грн.\n")

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
a1, a2 = 8019, 8
print("Залишок від ділення приклад а) =", a1 % a2)
b1, b2 = 9907, 9
print("Залишок від ділення приклад b) =", b1 % b2)
c1, c2 = 2789, 5
print("Залишок від ділення приклад c) =", c1 % c2)
d1, d2 = 7248, 6
print("Залишок від ділення приклад d) =", d1 % d2)
e1, e2 = 7128, 5
print("Залишок від ділення приклад e) =", e1 % e2)
f1, f2 = 19224, 9
print("Залишок від ділення приклад f) =", f1 % f2, "\n")

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
# Якось стало нудно просто так вирішувати задачки вирішив трошки додати різноманіття =)
numb_z = [4, 2, 4, 1, 3] # Список з кількістю замовлень
price_z = [274, 218, 35, 350, 21] # Список з вартістю кожної одиниці замовлень
prdct_lst = ["Піца велика", "Піца середня", "Сік", "Торт", "Вода"]
n = 0 # Початковий індекс
total_price = 0 # Змінна де буде зберігатись загальна вартість для даного замовлення
for i in numb_z: # Створюємо цикл який буде брати кількість та перемножувати на вартість
    res = i * price_z[n] # Беремо кількість і множимо на вартість, де n - індекс першого елементу в списку вартості
    print(f"{prdct_lst[n]} - {res} грн.") # Додав для наглядності загальну вартість по певній позиції
    total_price += res # Додаємо результат множення до змінної (тут кожний раз плюсуємо вартість по певній позиції до ітогового значення)
    n += 1 # Як цикл закінчується додаємо 1ку щоб при наступній ітерації перейти на наступний елемент списку
print(f"Іринці необхідно - {total_price} грн, для даного замовлення.\n")

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
numb_ph = 232
one_l = 8
l_numb = int(numb_ph / one_l)
print(f"Ігор займається фотографією. Він вирішив зібрати всі свої {numb_ph}\n"
      f"фотографії та вклеїти в альбом. На одній сторінці може бути\n"
      f"розміщено щонайбільше 8 фото.\n"
      f"Ігорю, знадобиться {l_numb} сторінок.\n")

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
distance = 1600 #
s_dist = 100
s_fuel = 9
tank = 48
total_fuel = int((distance / s_dist) * s_fuel)
stops = int(total_fuel / tank)
print(f"Родина зібралася в автомобільну подорож із Харкова в Буда-\n"
      f"пешт. Відстань між цими містами становить {distance} км. Відомо,\n"
      f"що на кожні {s_dist} км необхідно {s_fuel} літрів бензину. Місткість баку\n"
      f"становить {tank} літрів.\n"
      f"1) Скільки літрів бензину знадобиться для такої подорожі?\n"
      f"Для такої подорожі необхідно буде {total_fuel} літрів бензину.\n"
      f"2) Скільки щонайменше разів родині необхідно заїхати на зап-\n"
      f"равку під час цієї подорожі, кожного разу заправляючи повний бак?\n"
      f"Родині необхідно заїхати на заправку {stops} рази.")

