# Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h"
# (враховуються як великі так і маленькі). Цикл не повинен завершитися, якщо користувач
# ввів слово без букви "h".
loop = True
while loop:
    any_input = input("Будь ласка напишіть будь яке слово що містить літеру H або h:\n")
    for i in any_input:
        if i == 'h' or i == 'H':
            print("Стоп, літера H або h була знайдена!")
            loop = False
            break
        else:
            print(f"{i} - Це не та літера що ми шукаєм!")
